from horizontal_checks import *
from vertical_checks import *
from diagonal_checks import *

def elegxosPinaka1(pinakas,sthles):
    """
    >>> pinakas=[[1,1,1,1,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0]]
    >>> elegxosPinaka1(pinakas,6)
    ([[3, 3, 3, 3, 0, 0], [0, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 0]], True)
    >>> pinakas=[[1,0,0,0,0,0],[1,0,0,0,0,0],[1,0,0,0,0,0],[1,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0]]
    >>> elegxosPinaka1(pinakas,6)
    ([[3, 0, 0, 0, 0, 0], [3, 0, 0, 0, 0, 0], [3, 0, 0, 0, 0, 0], [3, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 0]], True)
    >>> pinakas=[[1,0,0,0,0,0],[0,1,0,0,0,0],[0,0,1,0,0,0],[0,0,0,1,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0]]
    >>> elegxosPinaka1(pinakas,6)
    ([[3, 0, 0, 0, 0, 0], [0, 3, 0, 0, 0, 0], [0, 0, 3, 0, 0, 0], [0, 0, 0, 3, 0, 0], [0, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 0]], True)
    >>> pinakas=[[0,1,0,0,0,0],[0,0,1,0,0,0],[0,0,0,1,0,0],[0,0,0,0,1,0],[0,0,0,0,0,0],[0,0,0,0,0,0]]
    >>> elegxosPinaka1(pinakas,6)
    ([[0, 3, 0, 0, 0, 0], [0, 0, 3, 0, 0, 0], [0, 0, 0, 3, 0, 0], [0, 0, 0, 0, 3, 0], [0, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 0]], True)
    >>> pinakas=[[0,0,0,0,0,0],[1,0,0,0,0,0],[0,1,0,0,0,0],[0,0,1,0,0,0],[0,0,0,1,0,0],[0,0,0,0,0,0]]
    >>> elegxosPinaka1(pinakas,6)
    ([[0, 0, 0, 0, 0, 0], [3, 0, 0, 0, 0, 0], [0, 3, 0, 0, 0, 0], [0, 0, 3, 0, 0, 0], [0, 0, 0, 3, 0, 0], [0, 0, 0, 0, 0, 0]], True)
    >>> pinakas=[[0,0,0,0,0,1],[0,0,0,0,1,0],[0,0,0,1,0,0],[0,0,1,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0]]
    >>> elegxosPinaka1(pinakas,6)
    ([[0, 0, 0, 0, 0, 3], [0, 0, 0, 0, 3, 0], [0, 0, 0, 3, 0, 0], [0, 0, 3, 0, 0, 0], [0, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 0]], True)
    >>> pinakas=[[0,0,0,0,1,0],[0,0,0,1,0,0],[0,0,1,0,0,0],[0,1,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0]]
    >>> elegxosPinaka1(pinakas,6)
    ([[0, 0, 0, 0, 3, 0], [0, 0, 0, 3, 0, 0], [0, 0, 3, 0, 0, 0], [0, 3, 0, 0, 0, 0], [0, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 0]], True)
    >>> pinakas=[[0,0,0,0,0,0],[0,0,0,0,0,1],[0,0,0,0,1,0],[0,0,0,1,0,0],[0,0,1,0,0,0],[0,0,0,0,0,0]]
    >>> elegxosPinaka1(pinakas,6)
    ([[0, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 3], [0, 0, 0, 0, 3, 0], [0, 0, 0, 3, 0, 0], [0, 0, 3, 0, 0, 0], [0, 0, 0, 0, 0, 0]], True)
    >>> pinakas=[[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0]]
    >>> elegxosPinaka1(pinakas,6)
    ([[0, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 0]], False)
    """
    """
    Ελέγχει ολόκληρο τον πίνακα για ύπαρξη τετράδας με πιόνια του παίκτη 1 (οριζόντια,
    κάθετα,διαγώνια) και επιστρέφει True αν υπάρχει, αλλιώς False.
    sthles --> Αριθμός στηλών πίνακα.
    pinakas --> Λίστα που περιέχει τα στοιχεία κάθε γραμμής του πίνακα σε εμφωλευμένες λίστες.
    """
    four1=False
    pinakas,four1=orizontia1(pinakas,sthles)
    if four1==False:
        pinakas,four1=katheta1(pinakas,sthles)
        if four1==False:
            pinakas,four1=kiria1(pinakas,sthles)
            if four1==False:
                pinakas,four1=panw_kirias1(pinakas,sthles)
                if four1==False:
                    pinakas,four1=katw_kirias1(pinakas,sthles)
                    if four1==False:
                        pinakas,four1=deuter1(pinakas,sthles)
                        if four1==False:
                            pinakas,four1=panw_deuter1(pinakas,sthles)
                            if four1==False:
                                pinakas,four1=katw_deuter1(pinakas,sthles)
    return pinakas,four1

def elegxosPinaka2(pinakas,sthles):
    """
    >>> pinakas=[[2,2,2,2,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0]]
    >>> elegxosPinaka2(pinakas,6)
    ([[3, 3, 3, 3, 0, 0], [0, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 0]], True)
    >>> pinakas=[[2,0,0,0,0,0],[2,0,0,0,0,0],[2,0,0,0,0,0],[2,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0]]
    >>> elegxosPinaka2(pinakas,6)
    ([[3, 0, 0, 0, 0, 0], [3, 0, 0, 0, 0, 0], [3, 0, 0, 0, 0, 0], [3, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 0]], True)
    >>> pinakas=[[2,0,0,0,0,0],[0,2,0,0,0,0],[0,0,2,0,0,0],[0,0,0,2,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0]]
    >>> elegxosPinaka2(pinakas,6)
    ([[3, 0, 0, 0, 0, 0], [0, 3, 0, 0, 0, 0], [0, 0, 3, 0, 0, 0], [0, 0, 0, 3, 0, 0], [0, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 0]], True)
    >>> pinakas=[[0,2,0,0,0,0],[0,0,2,0,0,0],[0,0,0,2,0,0],[0,0,0,0,2,0],[0,0,0,0,0,0],[0,0,0,0,0,0]]
    >>> elegxosPinaka2(pinakas,6)
    ([[0, 3, 0, 0, 0, 0], [0, 0, 3, 0, 0, 0], [0, 0, 0, 3, 0, 0], [0, 0, 0, 0, 3, 0], [0, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 0]], True)
    >>> pinakas=[[0,0,0,0,0,0],[2,0,0,0,0,0],[0,2,0,0,0,0],[0,0,2,0,0,0],[0,0,0,2,0,0],[0,0,0,0,0,0]]
    >>> elegxosPinaka2(pinakas,6)
    ([[0, 0, 0, 0, 0, 0], [3, 0, 0, 0, 0, 0], [0, 3, 0, 0, 0, 0], [0, 0, 3, 0, 0, 0], [0, 0, 0, 3, 0, 0], [0, 0, 0, 0, 0, 0]], True)
    >>> pinakas=[[0,0,0,0,0,2],[0,0,0,0,2,0],[0,0,0,2,0,0],[0,0,2,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0]]
    >>> elegxosPinaka2(pinakas,6)
    ([[0, 0, 0, 0, 0, 3], [0, 0, 0, 0, 3, 0], [0, 0, 0, 3, 0, 0], [0, 0, 3, 0, 0, 0], [0, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 0]], True)
    >>> pinakas=[[0,0,0,0,2,0],[0,0,0,2,0,0],[0,0,2,0,0,0],[0,2,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0]]
    >>> elegxosPinaka2(pinakas,6)
    ([[0, 0, 0, 0, 3, 0], [0, 0, 0, 3, 0, 0], [0, 0, 3, 0, 0, 0], [0, 3, 0, 0, 0, 0], [0, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 0]], True)
    >>> pinakas=[[0,0,0,0,0,0],[0,0,0,0,0,2],[0,0,0,0,2,0],[0,0,0,2,0,0],[0,0,2,0,0,0],[0,0,0,0,0,0]]
    >>> elegxosPinaka2(pinakas,6)
    ([[0, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 3], [0, 0, 0, 0, 3, 0], [0, 0, 0, 3, 0, 0], [0, 0, 3, 0, 0, 0], [0, 0, 0, 0, 0, 0]], True)
    >>> pinakas=[[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0]]
    >>> elegxosPinaka2(pinakas,6)
    ([[0, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 0]], False)
    """
    """
    Ελέγχει ολόκληρο τον πίνακα για ύπαρξη τετράδας με πιόνια του παίκτη 2 (οριζόντια,
    κάθετα,διαγώνια) και επιστρέφει True αν υπάρχει, αλλιώς False.
    sthles --> Αριθμός στηλών πίνακα.
    pinakas --> Λίστα που περιέχει τα στοιχεία κάθε γραμμής του πίνακα σε εμφωλευμένες λίστες.
    """
    four2=False
    pinakas,four2=orizontia2(pinakas,sthles)
    if four2==False:
        pinakas,four2=katheta2(pinakas,sthles)
        if four2==False:
            pinakas,four2=kiria2(pinakas,sthles)
            if four2==False:
                pinakas,four2=panw_kirias2(pinakas,sthles)
                if four2==False:
                    pinakas,four2=katw_kirias2(pinakas,sthles)
                    if four2==False:
                        pinakas,four2=deuter2(pinakas,sthles)
                        if four2==False:
                            pinakas,four2=panw_deuter2(pinakas,sthles)
                            if four2==False:
                                pinakas,four2=katw_deuter2(pinakas,sthles)
    return pinakas,four2

def gematospinakas(pinakas,sthles): 
    """
    >>> pinakas=[[1,2,2],[1,1,1],[2,2,2]]
    >>> gematospinakas(pinakas,3)
    True
    >>> pinakas=[[1,0,2],[1,1,1],[2,2,2]]
    >>> gematospinakas(pinakas,3)
    False
    """            
    """
    Ελέγχει αν ο πίνακας είναι γεμάτος ώστε να αποτρέψει τους χρήστες να προσθέσουν στοιχεία
    επιστρέφοντας μία λογική τιμή (flag).
    sthles --> Αριθμός στηλών πίνακα.
    pinakas --> Λίστα που περιέχει τα στοιχεία κάθε γραμμής του πίνακα σε εμφωλευμένες λίστες.
    """
    flag=True
    i=0
    while i<=sthles-1 and flag==True:
        if pinakas[0][i]==0:
            flag=False
        i+=1
    return flag