def kiria1(pinakas,sthles):
    """
    >>> pinakas=[[0,0,0,0,0],[0,1,0,0,0],[2,2,1,2,2],[2,1,2,1,0],[0,2,0,2,1]]
    >>> kiria1(pinakas,5)
    ([[0, 0, 0, 0, 0], [0, 3, 0, 0, 0], [2, 2, 3, 2, 2], [2, 1, 2, 3, 0], [0, 2, 0, 2, 3]], True)
    >>> pinakas=[[1,0,0,0,0,0],[0,1,0,0,0,0],[0,0,1,0,0,0],[0,0,0,1,0,0],[0,0,0,0,1,0],[0,0,0,0,0,0]]
    >>> kiria1(pinakas,6)
    ([[3, 0, 0, 0, 0, 0], [0, 3, 0, 0, 0, 0], [0, 0, 3, 0, 0, 0], [0, 0, 0, 3, 0, 0], [0, 0, 0, 0, 4, 0], [0, 0, 0, 0, 0, 0]], True)
    """
    """
    Ελέγχει για ύπαρξη τετράδας του παίκτη 1 στην κύρια 
    διαγώνιο επιστρέφοντας την τιμή True αν υπάρχει, αλλιώς False. Αν υπάρχει μετατρέπει
    την τετράδα σε '3' και τα γειτονικά πιόνια του ίδιου παίκτη σε '4'.
    sthles --> Αριθμός στηλών πίνακα.
    pinakas --> Λίστα που περιέχει τα στοιχεία κάθε γραμμής του πίνακα σε εμφωλευμένες λίστες.
    """
    four1=False
    c1=0
    for i in range(sthles):
        for j in range(sthles):
            if i==j and pinakas[i][j]==1:
                c1+=1
            elif i==j and pinakas[i][j]!=1:
                c1=0
            if c1==4:
                c1=0
                four1=True
                for k in range(0,4):
                    pinakas[i-k][j-k]=3
                #Έλεγχος πιονιών στην ίδια διεύθυνση με την τετράδα
                for m in range(i+1,sthles):
                    for k in range(j+1,sthles):
                        if (pinakas[m-1][k-1]==3 or pinakas[m-1][k-1]==4) and pinakas[m][k]==1:
                            pinakas[m][k]=4
    return pinakas,four1

def kiria2(pinakas,sthles):
    """
    >>> pinakas=[[0,0,0,0,0],[0,2,0,0,0],[1,1,2,1,1],[1,2,1,2,0],[0,1,0,1,2]]
    >>> kiria2(pinakas,5)
    ([[0, 0, 0, 0, 0], [0, 3, 0, 0, 0], [1, 1, 3, 1, 1], [1, 2, 1, 3, 0], [0, 1, 0, 1, 3]], True)
    >>> pinakas=[[2,0,0,0,0,0],[0,2,0,0,0,0],[0,0,2,0,0,0],[0,0,0,2,0,0],[0,0,0,0,2,0],[0,0,0,0,0,0]]
    >>> kiria2(pinakas,6)
    ([[3, 0, 0, 0, 0, 0], [0, 3, 0, 0, 0, 0], [0, 0, 3, 0, 0, 0], [0, 0, 0, 3, 0, 0], [0, 0, 0, 0, 4, 0], [0, 0, 0, 0, 0, 0]], True)
    """
    """
    Ελέγχει για ύπαρξη τετράδας του παίκτη 2 διαγώνια στην κύρια 
    διαγώνιο επιστρέφοντας την τιμή True αν υπάρχει, αλλιώς False. Αν υπάρχει μετατρέπει
    την τετράδα σε '3' και τα γειτονικά πιόνια του ίδιου παίκτη σε '4'.
    sthles --> Αριθμός στηλών πίνακα.
    pinakas --> Λίστα που περιέχει τα στοιχεία κάθε γραμμής του πίνακα σε εμφωλευμένες λίστες.
    """
    four2=False
    c2=0
    for i in range(sthles):
        for j in range(sthles):
            if i==j and pinakas[i][j]==2:
                c2+=1
            elif i==j and pinakas[i][j]!=2:
                c2=0
            if c2==4:
                c2=0
                four2=True
                for k in range(0,4):
                    pinakas[i-k][j-k]=3
                #Έλεγχος πιονιών στην ίδια διεύθυνση με την τετράδα
                for m in range(i+1,sthles):
                    for k in range(j+1,sthles):
                        if (pinakas[m-1][k-1]==3 or pinakas[m-1][k-1]==4) and pinakas[m][k]==2:
                            pinakas[m][k]=4
    return pinakas,four2

def katw_kirias1(pinakas,sthles):
    """
    >>> pinakas=[[0,0,0,0,0,0],[1,0,0,0,0,0],[0,1,0,0,0,0],[0,0,1,0,0,0],[0,0,0,1,0,0],[0,0,0,0,0,0]]
    >>> katw_kirias1(pinakas,6)
    ([[0, 0, 0, 0, 0, 0], [3, 0, 0, 0, 0, 0], [0, 3, 0, 0, 0, 0], [0, 0, 3, 0, 0, 0], [0, 0, 0, 3, 0, 0], [0, 0, 0, 0, 0, 0]], True)
    >>> pinakas=[[0,0,0,0,0,0],[1,0,0,0,0,0],[0,1,0,0,0,0],[0,0,1,0,0,0],[0,0,0,1,0,0],[0,0,0,0,1,0]]
    >>> katw_kirias1(pinakas,6)
    ([[0, 0, 0, 0, 0, 0], [3, 0, 0, 0, 0, 0], [0, 3, 0, 0, 0, 0], [0, 0, 3, 0, 0, 0], [0, 0, 0, 3, 0, 0], [0, 0, 0, 0, 4, 0]], True)
    """
    """
    Ελέγχει για ύπαρξη τετράδας του παίκτη 1 διαγώνια και κάτω από την κύρια 
    διαγώνιο επιστρέφοντας την τιμή True αν υπάρχει, αλλιώς False. Αν υπάρχει μετατρέπει
    την τετράδα σε '3' και τα γειτονικά πιόνια του ίδιου παίκτη σε '4'.
    sthles --> Αριθμός στηλών πίνακα.
    pinakas --> Λίστα που περιέχει τα στοιχεία κάθε γραμμής του πίνακα σε εμφωλευμένες λίστες.
    """
    four1=False
    for k in range(1,sthles-1):
        c=0
        for i in range(sthles):
            for j in range(sthles):
                if i>j:
                    if i-j==k and pinakas[i][j]==1:
                        c+=1
                    elif i-j==k and pinakas[i][j]!=1:
                        c=0
                    if c==4:
                        c=0
                        four1=True
                        for n in range(0,4):
                            pinakas[i-n][j-n]=3
                        #Έλεγχος πιονιών στην ίδια διεύθυνση με την τετράδα
                        for m in range(i+1,sthles):
                            for k in range(j+1,sthles):
                                if (pinakas[m-1][k-1]==3 or pinakas[m-1][k-1]==4) and pinakas[m][k]==1:
                                    pinakas[m][k]=4
    return pinakas,four1

def katw_kirias2(pinakas,sthles):
    """
    >>> pinakas=[[0,0,0,0,0,0],[2,0,0,0,0,0],[0,2,0,0,0,0],[0,0,2,0,0,0],[0,0,0,2,0,0],[0,0,0,0,0,0]]
    >>> katw_kirias2(pinakas,6)
    ([[0, 0, 0, 0, 0, 0], [3, 0, 0, 0, 0, 0], [0, 3, 0, 0, 0, 0], [0, 0, 3, 0, 0, 0], [0, 0, 0, 3, 0, 0], [0, 0, 0, 0, 0, 0]], True)
    >>> pinakas=[[0,0,0,0,0,0],[2,0,0,0,0,0],[0,2,0,0,0,0],[0,0,2,0,0,0],[0,0,0,2,0,0],[0,0,0,0,2,0]]
    >>> katw_kirias2(pinakas,6)
    ([[0, 0, 0, 0, 0, 0], [3, 0, 0, 0, 0, 0], [0, 3, 0, 0, 0, 0], [0, 0, 3, 0, 0, 0], [0, 0, 0, 3, 0, 0], [0, 0, 0, 0, 4, 0]], True)
    """
    """
    Ελέγχει για ύπαρξη τετράδας του παίκτη 2 διαγώνια και κάτω από την κύρια 
    διαγώνιο επιστρέφοντας την τιμή True αν υπάρχει, αλλιώς False. Αν υπάρχει μετατρέπει
    την τετράδα σε '3' και τα γειτονικά πιόνια του ίδιου παίκτη σε '4'.
    sthles --> Αριθμός στηλών πίνακα.
    pinakas --> Λίστα που περιέχει τα στοιχεία κάθε γραμμής του πίνακα σε εμφωλευμένες λίστες.
    """
    four2=False
    for k in range(1,sthles-1):
        c=0
        for i in range(sthles):
            for j in range(sthles):
                if i>j:
                    if i-j==k and pinakas[i][j]==2:
                        c+=1
                    elif i-j==k and pinakas[i][j]!=2:
                        c=0
                    if c==4:
                        c=0
                        four2=True
                        for n in range(0,4):
                            pinakas[i-n][j-n]=3
                        #Έλεγχος πιονιών στην ίδια διεύθυνση με την τετράδα
                        for m in range(i+1,sthles):
                            for k in range(j+1,sthles):
                                if (pinakas[m-1][k-1]==3 or pinakas[m-1][k-1]==4) and pinakas[m][k]==2:
                                    pinakas[m][k]=4
    return pinakas,four2

def panw_kirias1(pinakas,sthles):
    """
    >>> pinakas=[[0,1,0,0,0,0],[0,0,1,0,0,0],[0,0,0,1,0,0],[0,0,0,0,1,0],[0,0,0,0,0,0],[0,0,0,0,0,0]]
    >>> panw_kirias1(pinakas,6)
    ([[0, 3, 0, 0, 0, 0], [0, 0, 3, 0, 0, 0], [0, 0, 0, 3, 0, 0], [0, 0, 0, 0, 3, 0], [0, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 0]], True)
    >>> pinakas=[[0,1,0,0,0,0],[0,0,1,0,0,0],[0,0,0,1,0,0],[0,0,0,0,1,0],[0,0,0,0,0,1],[0,0,0,0,0,0]]
    >>> panw_kirias1(pinakas,6)
    ([[0, 3, 0, 0, 0, 0], [0, 0, 3, 0, 0, 0], [0, 0, 0, 3, 0, 0], [0, 0, 0, 0, 3, 0], [0, 0, 0, 0, 0, 4], [0, 0, 0, 0, 0, 0]], True)
    """
    """
    Ελέγχει για ύπαρξη τετράδας του παίκτη 1 διαγώνια και πάνω από την κύρια 
    διαγώνιο επιστρέφοντας την τιμή True αν υπάρχει, αλλιώς False. Αν υπάρχει μετατρέπει
    την τετράδα σε '3' και τα γειτονικά πιόνια του ίδιου παίκτη σε '4'.
    sthles --> Αριθμός στηλών πίνακα.
    pinakas --> Λίστα που περιέχει τα στοιχεία κάθε γραμμής του πίνακα σε εμφωλευμένες λίστες.
    """
    four1=False
    for k in range(1,sthles-1):
        c=0
        for i in range(sthles):
            for j in range(sthles):
                if i<j:
                    if j-i==k and pinakas[i][j]==1:
                        c+=1
                    elif j-i==k and pinakas[i][j]!=1:
                        c=0
                    if c==4:
                        c=0
                        four1=True
                        for n in range(0,4):
                            pinakas[i-n][j-n]=3
                        #Έλεγχος πιονιών στην ίδια διεύθυνση με την τετράδα
                        for m in range(i+1,sthles):
                            for k in range(j+1,sthles):
                                if (pinakas[m-1][k-1]==3 or pinakas[m-1][k-1]==4) and pinakas[m][k]==1:
                                    pinakas[m][k]=4
    return pinakas,four1

def panw_kirias2(pinakas,sthles):
    """
    >>> pinakas=[[0,2,0,0,0,0],[0,0,2,0,0,0],[0,0,0,2,0,0],[0,0,0,0,2,0],[0,0,0,0,0,0],[0,0,0,0,0,0]]
    >>> panw_kirias2(pinakas,6)
    ([[0, 3, 0, 0, 0, 0], [0, 0, 3, 0, 0, 0], [0, 0, 0, 3, 0, 0], [0, 0, 0, 0, 3, 0], [0, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 0]], True)
    >>> pinakas=[[0,2,0,0,0,0],[0,0,2,0,0,0],[0,0,0,2,0,0],[0,0,0,0,2,0],[0,0,0,0,0,2],[0,0,0,0,0,0]]
    >>> panw_kirias2(pinakas,6)
    ([[0, 3, 0, 0, 0, 0], [0, 0, 3, 0, 0, 0], [0, 0, 0, 3, 0, 0], [0, 0, 0, 0, 3, 0], [0, 0, 0, 0, 0, 4], [0, 0, 0, 0, 0, 0]], True)
    """
    """
    Ελέγχει για ύπαρξη τετράδας του παίκτη 2 διαγώνια και πάνω από την κύρια 
    διαγώνιο επιστρέφοντας την τιμή True αν υπάρχει, αλλιώς False. Αν υπάρχει μετατρέπει
    την τετράδα σε '3' και τα γειτονικά πιόνια του ίδιου παίκτη σε '4'.
    sthles --> Αριθμός στηλών πίνακα.
    pinakas --> Λίστα που περιέχει τα στοιχεία κάθε γραμμής του πίνακα σε εμφωλευμένες λίστες.
    """
    four2=False
    for k in range(1,sthles-1):
        c=0
        for i in range(sthles):
            for j in range(sthles):
                if i<j:
                    if j-i==k and pinakas[i][j]==2:
                        c+=1
                    elif j-i==k and pinakas[i][j]!=2:
                        c=0
                    if c==4:
                        c=0
                        four2=True
                        for n in range(0,4):
                            pinakas[i-n][j-n]=3
                        #Έλεγχος πιονιών στην ίδια διεύθυνση με την τετράδα
                        for m in range(i+1,sthles):
                            for k in range(j+1,sthles):
                                if (pinakas[m-1][k-1]==3 or pinakas[m-1][k-1]==4) and pinakas[m][k]==2:
                                    pinakas[m][k]=4
    return pinakas,four2

def deuter1(pinakas,sthles):
    """
    >>> pinakas=[[0,0,0,0,0,1],[0,0,0,0,1,0],[0,0,0,1,0,0],[0,0,1,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0]]
    >>> deuter1(pinakas,6)
    ([[0, 0, 0, 0, 0, 3], [0, 0, 0, 0, 3, 0], [0, 0, 0, 3, 0, 0], [0, 0, 3, 0, 0, 0], [0, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 0]], True)
    >>> pinakas=[[0,0,0,0,0,1],[0,0,0,0,1,0],[0,0,0,1,0,0],[0,0,1,0,0,0],[0,1,0,0,0,0],[1,0,0,0,0,0]]
    >>> deuter1(pinakas,6)
    ([[0, 0, 0, 0, 0, 3], [0, 0, 0, 0, 3, 0], [0, 0, 0, 3, 0, 0], [0, 0, 3, 0, 0, 0], [0, 4, 0, 0, 0, 0], [4, 0, 0, 0, 0, 0]], True)

    """
    """
    Ελέγχει για ύπαρξη τετράδας του παίκτη 1 στην δευτερεύουσα 
    διαγώνιο επιστρέφοντας την τιμή True αν υπάρχει, αλλιώς False. Αν υπάρχει μετατρέπει
    την τετράδα σε '3' και τα γειτονικά πιόνια του ίδιου παίκτη σε '4'.
    sthles --> Αριθμός στηλών πίνακα.
    pinakas --> Λίστα που περιέχει τα στοιχεία κάθε γραμμής του πίνακα σε εμφωλευμένες λίστες.
    """
    four1=False
    c=0
    for i in range(sthles):
        for j in range(sthles):
            if i+j==sthles-1 and pinakas[i][j]==1:
                c+=1
            elif i+j==sthles-1 and pinakas[i][j]!=1:
                c=0
            if c==4:
                c=0
                four1=True
                for k in range(0,4):
                    pinakas[i-k][j+k]=3
                #Έλεγχος πιονιών στην ίδια διεύθυνση με την τετράδα
                k=j
                for m in range(i,sthles-1):
                    if pinakas[m+1][k-1]==1 and (pinakas[m][k]==3 or pinakas[m][k]==4):
                        pinakas[m+1][k-1]=4
                    k-=1 
    return pinakas,four1

def deuter2(pinakas,sthles):
    """
    >>> pinakas=[[0,0,0,0,0,2],[0,0,0,0,2,0],[0,0,0,2,0,0],[0,0,2,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0]]
    >>> deuter2(pinakas,6)
    ([[0, 0, 0, 0, 0, 3], [0, 0, 0, 0, 3, 0], [0, 0, 0, 3, 0, 0], [0, 0, 3, 0, 0, 0], [0, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 0]], True)
    >>> pinakas=[[0,0,0,0,0,2],[0,0,0,0,2,0],[0,0,0,2,0,0],[0,0,2,0,0,0],[0,2,0,0,0,0],[2,0,0,0,0,0]]
    >>> deuter2(pinakas,6)
    ([[0, 0, 0, 0, 0, 3], [0, 0, 0, 0, 3, 0], [0, 0, 0, 3, 0, 0], [0, 0, 3, 0, 0, 0], [0, 4, 0, 0, 0, 0], [4, 0, 0, 0, 0, 0]], True)

    """
    """
    Ελέγχει για ύπαρξη τετράδας του παίκτη 2 στην δευτερεύουσα 
    διαγώνιο επιστρέφοντας την τιμή True αν υπάρχει, αλλιώς False. Αν υπάρχει μετατρέπει
    την τετράδα σε '3' και τα γειτονικά πιόνια του ίδιου παίκτη σε '4'.
    sthles --> Αριθμός στηλών πίνακα.
    pinakas --> Λίστα που περιέχει τα στοιχεία κάθε γραμμής του πίνακα σε εμφωλευμένες λίστες.
    """
    four2=False
    c=0
    for i in range(sthles):
        for j in range(sthles):
            if i+j==sthles-1 and pinakas[i][j]==2:
                c+=1
            elif i+j==sthles-1 and pinakas[i][j]!=2:
                c=0
            if c==4:
                c=0
                four2=True
                for k in range(0,4):
                    pinakas[i-k][j+k]=3
                #Έλεγχος πιονιών στην ίδια διεύθυνση με την τετράδα
                k=j
                for m in range(i,sthles-1):
                    if pinakas[m+1][k-1]==2 and (pinakas[m][k]==3 or pinakas[m][k]==4):
                        pinakas[m+1][k-1]=4
                    k-=1 
    return pinakas,four2

def panw_deuter1(pinakas,sthles):
    """
    >>> pinakas=[[0,0,0,0,1,0],[0,0,0,1,0,0],[0,0,1,0,0,0],[0,1,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0]]
    >>> panw_deuter1(pinakas,6)
    ([[0, 0, 0, 0, 3, 0], [0, 0, 0, 3, 0, 0], [0, 0, 3, 0, 0, 0], [0, 3, 0, 0, 0, 0], [0, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 0]], True)
    >>> pinakas=[[0,0,0,0,1,0],[0,0,0,1,0,0],[0,0,1,0,0,0],[0,1,0,0,0,0],[1,0,0,0,0,0],[0,0,0,0,0,0]]
    >>> panw_deuter1(pinakas,6)
    ([[0, 0, 0, 0, 3, 0], [0, 0, 0, 3, 0, 0], [0, 0, 3, 0, 0, 0], [0, 3, 0, 0, 0, 0], [4, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 0]], True)
    """
    """
    Ελέγχει για ύπαρξη τετράδας του παίκτη 1 διαγώνια και πάνω από την δευτερεύουσα 
    διαγώνιο επιστρέφοντας την τιμή True αν υπάρχει, αλλιώς False. Αν υπάρχει μετατρέπει
    την τετράδα σε '3' και τα γειτονικά πιόνια του ίδιου παίκτη σε '4'.
    sthles --> Αριθμός στηλών πίνακα.
    pinakas --> Λίστα που περιέχει τα στοιχεία κάθε γραμμής του πίνακα σε εμφωλευμένες λίστες.
    """
    four1=False
    for z in range(1,sthles-1):
        c=0
        for i in range(sthles):
            for j in range(sthles):
                if i+j<sthles-1:
                    if i+j==z and pinakas[i][j]==1:
                        c+=1
                    elif i+j==z and pinakas[i][j]!=1:
                        c=0
                    if c==4:
                        c=0
                        four1=True
                        for x in range(0,4):
                            pinakas[i-x][j+x]=3
                        #Έλεγχος πιονιών στην ίδια διεύθυνση με την τετράδα
                        k=j
                        for m in range(i,sthles-1):
                            if pinakas[m+1][k-1]==1 and (pinakas[m][k]==3 or pinakas[m][k]==4):
                                pinakas[m+1][k-1]=4
                                k-=1 
    return pinakas,four1

def panw_deuter2(pinakas,sthles):
    """
    >>> pinakas=[[0,0,0,0,2,0],[0,0,0,2,0,0],[0,0,2,0,0,0],[0,2,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0]]
    >>> panw_deuter2(pinakas,6)
    ([[0, 0, 0, 0, 3, 0], [0, 0, 0, 3, 0, 0], [0, 0, 3, 0, 0, 0], [0, 3, 0, 0, 0, 0], [0, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 0]], True)
    >>> pinakas=[[0,0,0,0,2,0],[0,0,0,2,0,0],[0,0,2,0,0,0],[0,2,0,0,0,0],[2,0,0,0,0,0],[0,0,0,0,0,0]]
    >>> panw_deuter2(pinakas,6)
    ([[0, 0, 0, 0, 3, 0], [0, 0, 0, 3, 0, 0], [0, 0, 3, 0, 0, 0], [0, 3, 0, 0, 0, 0], [4, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 0]], True)
    """
    """
    Ελέγχει για ύπαρξη τετράδας του παίκτη 2 διαγώνια και πάνω από την δευτερεύουσα 
    διαγώνιο επιστρέφοντας την τιμή True αν υπάρχει, αλλιώς False. Αν υπάρχει μετατρέπει
    την τετράδα σε '3' και τα γειτονικά πιόνια του ίδιου παίκτη σε '4'.
    sthles --> Αριθμός στηλών πίνακα.
    pinakas --> Λίστα που περιέχει τα στοιχεία κάθε γραμμής του πίνακα σε εμφωλευμένες λίστες.
    """
    four2=False
    for z in range(1,sthles-1):
        c=0
        for i in range(sthles):
            for j in range(sthles):
                if i+j<sthles-1:
                    if i+j==z and pinakas[i][j]==2:
                        c+=1
                    elif i+j==z and pinakas[i][j]!=2:
                        c=0
                    if c==4:
                        c=0
                        four2=True
                        for x in range(0,4):
                            pinakas[i-x][j+x]=3
                        #Έλεγχος πιονιών στην ίδια διεύθυνση με την τετράδα
                        k=j
                        for m in range(i,sthles-1):
                            if pinakas[m+1][k-1]==2 and (pinakas[m][k]==3 or pinakas[m][k]==4):
                                pinakas[m+1][k-1]=4
                                k-=1 
    return pinakas,four2

def katw_deuter1(pinakas,sthles):
    """
    >>> pinakas=[[0,0,0,0,0,0],[0,0,0,0,0,1],[0,0,0,0,1,0],[0,0,0,1,0,0],[0,0,1,0,0,0],[0,0,0,0,0,0]]
    >>> katw_deuter1(pinakas,6)
    ([[0, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 3], [0, 0, 0, 0, 3, 0], [0, 0, 0, 3, 0, 0], [0, 0, 3, 0, 0, 0], [0, 0, 0, 0, 0, 0]], True)
    >>> pinakas=[[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,1],[0,0,0,0,1,0],[0,0,0,1,0,0],[0,0,1,0,0,0]]
    >>> katw_deuter1(pinakas,6)
    ([[0, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 3], [0, 0, 0, 0, 3, 0], [0, 0, 0, 3, 0, 0], [0, 0, 3, 0, 0, 0]], True)
    >>> pinakas=[[0,0,0,0,0,0],[0,0,0,0,0,1],[0,0,0,0,1,0],[0,0,0,1,0,0],[0,0,1,0,0,0],[0,1,0,0,0,0]]
    >>> katw_deuter1(pinakas,6)
    ([[0, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 3], [0, 0, 0, 0, 3, 0], [0, 0, 0, 3, 0, 0], [0, 0, 3, 0, 0, 0], [0, 4, 0, 0, 0, 0]], True)
    """
    """
    Ελέγχει για ύπαρξη τετράδας του παίκτη 1 διαγώνια και κάτω από την δευτερεύουσα 
    διαγώνιο επιστρέφοντας την τιμή True αν υπάρχει, αλλιώς False. Αν υπάρχει μετατρέπει
    την τετράδα σε '3' και τα γειτονικά πιόνια του ίδιου παίκτη σε '4'.
    sthles --> Αριθμός στηλών πίνακα.
    pinakas --> Λίστα που περιέχει τα στοιχεία κάθε γραμμής του πίνακα σε εμφωλευμένες λίστες.
    """
    four1=False
    for z in range(1,sthles-1):
        c=0
        for i in range(sthles):
            for j in range(sthles):
                if i+j>sthles-1:
                    if i+j==sthles-1+z and pinakas[i][j]==1:
                        c+=1
                    elif i+j==sthles-1+z and pinakas[i][j]!=1:
                        c=0
                    if c==4:
                        c=0
                        four1=True
                        for a in range(0,4):
                            pinakas[i-a][j+a]=3
                        #Έλεγχος πιονιών στην ίδια διεύθυνση με την τετράδα
                        k=j
                        for m in range(i,sthles-1):
                            if pinakas[m+1][k-1]==1 and (pinakas[m][k]==3 or pinakas[m][k]==4):
                                pinakas[m+1][k-1]=4
                                k-=1 
    return pinakas,four1

def katw_deuter2(pinakas,sthles):
    """
    >>> pinakas=[[0,0,0,0,0,0],[0,0,0,0,0,2],[0,0,0,0,2,0],[0,0,0,2,0,0],[0,0,2,0,0,0],[0,0,0,0,0,0]]
    >>> katw_deuter2(pinakas,6)
    ([[0, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 3], [0, 0, 0, 0, 3, 0], [0, 0, 0, 3, 0, 0], [0, 0, 3, 0, 0, 0], [0, 0, 0, 0, 0, 0]], True)
    >>> pinakas=[[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,2],[0,0,0,0,2,0],[0,0,0,2,0,0],[0,0,2,0,0,0]]
    >>> katw_deuter2(pinakas,6)
    ([[0, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 3], [0, 0, 0, 0, 3, 0], [0, 0, 0, 3, 0, 0], [0, 0, 3, 0, 0, 0]], True)
    >>> pinakas=[[0,0,0,0,0,0],[0,0,0,0,0,2],[0,0,0,0,2,0],[0,0,0,2,0,0],[0,0,2,0,0,0],[0,2,0,0,0,0]]
    >>> katw_deuter2(pinakas,6)
    ([[0, 0, 0, 0, 0, 0], [0, 0, 0, 0, 0, 3], [0, 0, 0, 0, 3, 0], [0, 0, 0, 3, 0, 0], [0, 0, 3, 0, 0, 0], [0, 4, 0, 0, 0, 0]], True)
    """
    """
    Ελέγχει για ύπαρξη τετράδας του παίκτη 2 διαγώνια και κάτω από την δευτερεύουσα 
    διαγώνιο επιστρέφοντας την τιμή True αν υπάρχει, αλλιώς False. Αν υπάρχει μετατρέπει
    την τετράδα σε '3' και τα γειτονικά πιόνια του ίδιου παίκτη σε '4'.
    sthles --> Αριθμός στηλών πίνακα.
    pinakas --> Λίστα που περιέχει τα στοιχεία κάθε γραμμής του πίνακα σε εμφωλευμένες λίστες.
    """
    four2=False
    for z in range(1,sthles-1):
        c=0
        for i in range(sthles):
            for j in range(sthles):
                if i+j>sthles-1:
                    if i+j==sthles-1+z and pinakas[i][j]==2:
                        c+=1
                    elif i+j==sthles-1+z and pinakas[i][j]!=2:
                        c=0
                    if c==4:
                        c=0
                        four2=True
                        for a in range(0,4):
                            pinakas[i-a][j+a]=3
                        #Έλεγχος πιονιών στην ίδια διεύθυνση με την τετράδα
                        k=j
                        for m in range(i,sthles-1):
                            if pinakas[m+1][k-1]==2 and (pinakas[m][k]==3 or pinakas[m][k]==4):
                                pinakas[m+1][k-1]=4
                                k-=1 
    return pinakas,four2
