def katheta1(pinakas,sthles):
    """
    >>> pinakas=[[0,0,1,0,1],[1,0,1,0,1],[1,0,1,0,1],[1,0,0,0,1],[1,0,1,0,0]]
    >>> katheta1(pinakas,5)
    ([[0, 0, 1, 0, 3], [3, 0, 1, 0, 3], [3, 0, 1, 0, 3], [3, 0, 0, 0, 3], [3, 0, 1, 0, 0]], True)
    >>> pinakas=[[1,0,1,0,0,0],[1,0,1,0,1,1],[1,1,1,0,1,1],[1,1,1,0,1,1],[1,1,0,0,1,1],[1,1,0,0,0,1]]
    >>> katheta1(pinakas,6)
    ([[3, 0, 3, 0, 0, 0], [3, 0, 3, 0, 3, 3], [3, 3, 3, 0, 3, 3], [3, 3, 3, 0, 3, 3], [4, 3, 0, 0, 3, 3], [4, 3, 0, 0, 0, 4]], True)
    """
    """
    Ελέγχει για ύπαρξη τετράδας του παίκτη 1 κάθετα επιστρέφοντας την 
    τιμή True αν υπάρχει, αλλιώς False. Αν υπάρχει μετατρέπει
    την τετράδα σε '3' και τα γειτονικά πιόνια του ίδιου παίκτη σε '4'.
    sthles --> Αριθμός στηλών πίνακα.
    pinakas --> Λίστα που περιέχει τα στοιχεία κάθε γραμμής του πίνακα σε εμφωλευμένες λίστες.
    """
    four1=False
    for j in range(sthles):    
        c=0            
        for i in range(sthles):
            if pinakas[i][j]==1:
                c+=1
            else:
                c=0
            if c==4:
                four1=True
                for a in range(i-3,i+1):
                    pinakas[a][j]=3
                #Έλεγχος πιονιών στην ίδια διεύθυνση με την τετράδα
                for b in range(i-4,-1,-1):                      
                    if (pinakas[b+1][j]==3 or pinakas[b+1][j]==4) and pinakas[b][j]==1:
                        pinakas[b][j]=4
                for c in range(i+1,sthles):
                    if (pinakas[c-1][j]==3 or pinakas[c-1][j]==4) and pinakas[c][j]==1:
                        pinakas[c][j]=4
    return pinakas,four1

def katheta2(pinakas,sthles):
    """
    >>> pinakas=[[2,0,2,0,0,0],[2,0,2,0,2,2],[2,2,2,0,2,2],[2,2,2,0,2,2],[2,2,0,0,2,2],[2,2,0,0,0,2]]
    >>> katheta2(pinakas,6)
    ([[3, 0, 3, 0, 0, 0], [3, 0, 3, 0, 3, 3], [3, 3, 3, 0, 3, 3], [3, 3, 3, 0, 3, 3], [4, 3, 0, 0, 3, 3], [4, 3, 0, 0, 0, 4]], True)
    >>> pinakas=[[0,0,2,0,2],[2,0,2,0,2],[2,0,2,0,2],[2,0,0,0,2],[2,0,2,0,0]]
    >>> katheta2(pinakas,5)
    ([[0, 0, 2, 0, 3], [3, 0, 2, 0, 3], [3, 0, 2, 0, 3], [3, 0, 0, 0, 3], [3, 0, 2, 0, 0]], True)
    """
    """
    Ελέγχει για ύπαρξη τετράδας του παίκτη 2 κάθετα επιστρέφοντας την 
    τιμή True αν υπάρχει, αλλιώς False. Αν υπάρχει μετατρέπει
    την τετράδα σε '3' και τα γειτονικά πιόνια του ίδιου παίκτη σε '4'.
    sthles --> Αριθμός στηλών πίνακα.
    pinakas --> Λίστα που περιέχει τα στοιχεία κάθε γραμμής του πίνακα σε εμφωλευμένες λίστες.
    """
    four2=False
    for j in range(sthles):    
        c=0            
        for i in range(sthles):
            if pinakas[i][j]==2:
                c+=1
            else:
                c=0
            if c==4:
                four2=True
                for a in range(i-3,i+1):
                    pinakas[a][j]=3
                #Έλεγχος πιονιών στην ίδια διεύθυνση με την τετράδα
                for b in range(i-4,-1,-1):                      
                    if (pinakas[b+1][j]==3 or pinakas[b+1][j]==4) and pinakas[b][j]==2:
                        pinakas[b][j]=4
                for c in range(i+1,sthles):
                    if (pinakas[c-1][j]==3 or pinakas[c-1][j]==4) and pinakas[c][j]==2:
                        pinakas[c][j]=4
    return pinakas,four2